Австралия/src/Catalogs/PriceTypes/PriceTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>PriceTypes</name>
  <predefined>
    <items>
      <name>Wholesale</name>
      <description>Wholesale price</description>
    </items>
    <items>
      <name>Accounting</name>
      <description>Accounting price</description>
    </items>
  </predefined>
  <attributes>
    <name>PriceCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceIncludesVAT</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CalculatesDynamically</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PricesBaseKind</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Percent</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceCalculationMethod</name>
    <type>
      <types>EnumRef.PriceCalculationMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>Formula</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>OperandID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Enums/PriceCalculationMethods/PriceCalculationMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PriceCalculationMethods</name>
  <enumValues>
    <name>Manual</name>
  </enumValues>
  <enumValues>
    <name>CalculatedStatic</name>
  </enumValues>
  <enumValues>
    <name>CalculatedDynamic</name>
  </enumValues>
  <enumValues>
    <name>Formula</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/PriceTypes/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

// Procedure - event handler FillCheckProcessing object.
//
Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If PriceCalculationMethod = Enums.PriceCalculationMethods.Formula Then
		
		CheckedAttributes.Add("Formula");
		
	ElsIf PriceCalculationMethod = Enums.PriceCalculationMethods.CalculatedDynamic Then
		
		CheckedAttributes.Add("PricesBaseKind");
		CheckedAttributes.Add("Company");
		
		
	ElsIf PriceCalculationMethod = Enums.PriceCalculationMethods.CalculatedStatic Then
		
		CheckedAttributes.Add("PricesBaseKind");
		
	Else
		
		CheckedAttributes.Add("PriceCurrency");
		
	EndIf;
	
EndProcedure

Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If IsBlankString(OperandID) OR NOT PriceGenerationFormulaServerCall.CheckPriceTypeID(OperandID, Ref) Then
		
		PriceGenerationFormulaServerCall.GenerateNewIndicatorPriceType(OperandID, Description);
		
	EndIf;
	
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If Not GetFunctionalOption("UseSeveralCompanies") Then
		Company = Catalogs.Companies.MainCompany;
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
